tap "felixkratz/formulae"
tap "homebrew/cask-fonts"
tap "homebrew/command-not-found", "https://mirrors.tuna.tsinghua.edu.cn/git/homebrew/homebrew-command-not-found.git"
tap "homebrew/services", "https://mirrors.tuna.tsinghua.edu.cn/git/homebrew/homebrew-services.git"
tap "mac-cleanup/mac-cleanup-py"
tap "nikitabobko/tap"
tap "oven-sh/bun"
tap "semihalev/tap"
# Library for manipulating PNG images
brew "libpng"
# New file format for still image compression
brew "jpeg-xl"
# Codec library for encoding and decoding AV1 video streams
brew "aom"
# ARP scanning and fingerprinting tool
brew "arp-scan"
# Automatic configure script builder
brew "autoconf"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# Shell extension to jump to frequently used directories
brew "autojump"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Software library to render fonts
brew "freetype"
# Core application library for C
brew "glib"
# Vector graphics library with cross-device output support
brew "cairo"
# Decentralized dependency manager for Cocoa
brew "carthage"
# Statistics utility to count lines of code
brew "cloc"
# Suite of command-line tools for converting to and working with CSV
brew "csvkit"
# Measure DNS performance by simulating network conditions
brew "dnsperf"
# Convert text between DOS, UNIX, and Mac formats
brew "dos2unix"
# Like neofetch, but much faster because written mostly in C
brew "fastfetch"
# Library to load and enumerate PKCS#11 modules
brew "p11-kit"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# OpenType text shaping engine
brew "harfbuzz"
# Interpreted, interactive, object-oriented programming language
brew "python@3.12"
# Subtitle renderer for the ASS/SSA subtitle format
brew "libass"
# Framework for layout and rendering of i18n text
brew "pango"
# Low-level access to audio, keyboard, mouse, joystick, and graphics
brew "sdl2"
# Secure Reliable Transport
brew "srt"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# GNU compiler collection
brew "gcc"
# GitHub command-line tool
brew "gh"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Ping, but with a graph
brew "gping"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# GNU Ubiquitous Intelligent Language for Extensions
brew "guile"
# C/C++ and Java libraries for Unicode and globalization
brew "icu4c@76"
# Tool to measure maximum TCP and UDP bandwidth
brew "iperf"
# Update of iperf: measures TCP, UDP, and SCTP bandwidth
brew "iperf3"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Provides library functionality for FIDO U2F & FIDO 2.0, including USB
brew "libfido2"
# C library of Git core methods that is re-entrant and linkable
brew "libgit2"
# C library of Git core methods that is re-entrant and linkable
brew "libgit2@1.6"
# Development kit for the Java programming language
brew "openjdk"
# Java-based project management
brew "maven"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Port scanning utility for large networks
brew "nmap"
# Platform built on V8 to build network applications
brew "node"
# Optimized BLAS library
brew "openblas"
# Package for scientific computing with Python
brew "numpy"
# Open source suite of directory software
brew "openldap"
# Open Visual Inference And Optimization toolkit for AI inference
brew "openvino"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Python version management
brew "pyenv"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Utility that provides fast incremental file transfer
brew "rsync"
# SDL 1.2 compatibility layer that uses SDL 2.0 behind the scenes
brew "sdl12-compat"
# Graphics drawing primitives and other support functions
brew "sdl_gfx"
# Privacy important, fast, recursive dns resolver server with dnssec support
brew "sdns", restart_service: :changed
# Graphical command-line client for SSH
brew "sshs"
# Your CLI home video recorder
brew "vhs"
# Sends magic packets to wake up network-devices
brew "wakeonlan"
# A window border system for macOS
brew "felixkratz/formulae/borders"
# Python cleanup script for macOS
brew "mac-cleanup/mac-cleanup-py/mac-cleanup-py"
# Incredibly fast JavaScript runtime, bundler, transpiler and package manager - all in one.
brew "oven-sh/bun/bun"
# AeroSpace is an i3-like tiling window manager for macOS
cask "aerospace"
# Photography workflow application and raw developer
cask "darktable"
# Control your tools with a few keystrokes
cask "raycast"
vscode "aaron-bond.better-comments"
vscode "akirarika.vscode-hbuilder-green-light-theme"
vscode "alova.alova-vscode-extension"
vscode "andenetalexander.vim-cheatsheet"
vscode "antfu.unocss"
vscode "bierner.markdown-mermaid"
vscode "bradlc.vscode-tailwindcss"
vscode "chandzhang.wechat-snippet"
vscode "chris-noring.node-snippets"
vscode "christian-kohler.path-intellisense"
vscode "crazyurus.miniprogram-vscode-extension"
vscode "cschlosser.doxdocgen"
vscode "dariofuzinato.vue-peek"
vscode "darxeal.tampermonkey-snippets"
vscode "dbaeumer.vscode-eslint"
vscode "dotjoshjohnson.xml"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "editorconfig.editorconfig"
vscode "edwinhuish.better-comments-next"
vscode "esbenp.prettier-vscode"
vscode "evils.uniapp-vscode"
vscode "fehey.brackets-light-pro"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-rename-tag"
vscode "github.codespaces"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "github.vscode-github-actions"
vscode "golang.go"
vscode "gsgupta.opencv-snippets"
vscode "helgardrichard.helium-icon-theme"
vscode "hollowtree.vue-snippets"
vscode "hzjjg.mysalary"
vscode "inferrinizzard.prettier-sql-vscode"
vscode "jaluik.dot-log"
vscode "jeff-hykin.better-cpp-syntax"
vscode "jock.svg"
vscode "katsute.code-background"
vscode "kleber-swf.unity-code-snippets"
vscode "liamhammett.inline-parameters"
vscode "lkrms.inifmt"
vscode "lninl.theme-hbuilderx-soft-green-light"
vscode "lottiefiles.vscode-lottie"
vscode "mhcpnl.xcodestrings"
vscode "mhutchie.git-graph"
vscode "ms-ceintl.vscode-language-pack-zh-hans"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ngspeedster.night-stormvs"
vscode "orta.vscode-jest"
vscode "paulober.pico-w-go"
vscode "pflannery.vscode-versionlens"
vscode "redhat.java"
vscode "ritwickdey.liveserver"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "spikespaz.vscode-smoothtype"
vscode "streetsidesoftware.code-spell-checker"
vscode "styled-components.vscode-styled-components"
vscode "svelte.svelte-vscode"
vscode "thenikso.github-plus-theme"
vscode "tinkertrain.theme-panda"
vscode "ullissescastro.theme-bracketsdark"
vscode "uni-helper.uni-app-schemas-vscode"
vscode "uni-helper.uni-app-snippets-vscode"
vscode "uni-helper.uni-cloud-snippets-vscode"
vscode "uni-helper.uni-helper-vscode"
vscode "uni-helper.uni-highlight-vscode"
vscode "uni-helper.uni-ui-snippets-vscode"
vscode "usernamehw.errorlens"
vscode "vitest.explorer"
vscode "vscodevim.vim"
vscode "vue.volar"
vscode "waderyan.gitblame"
vscode "yclepticstudios.unity-snippets"
vscode "zhang.webstrome-theme"
vscode "zignd.html-css-class-completion"
